<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class NationalitiesTableSeeder extends Seeder
{
    public function run()
    {
        DB::table('nationalities')->insert([
            [
              'name' =>'ไทย'
            ],
            [
              'name' =>'อังกฤษ'
            ],
            [
              'name' =>'ปอร์ตุเกส'
            ],
            [
              'name' =>'เนเธอร์แลนด์'
            ],
            [
              'name' =>'เยอรมัน'
            ],
            [
              'name' =>'ผรั่งเศส'
            ],
            [
              'name' =>'เดนมาร์ก'
            ],
            [
              'name' =>'สวีเดน'
            ],
            [
              'name' =>'สวีสเซอร์แลนด์'
            ],
            [
              'name' =>'อิตาลี'
            ],
            [
              'name' =>'นอร์เวย์'
            ],
            [
              'name' =>'ออสเตรีย'
            ],
            [
              'name' =>'ไอร์แลนด์'
            ],
            [
              'name' =>'ฟินแลนด์'
            ],
            [
              'name' =>'เบลเยี่ยม'
            ],
            [
              'name' =>'เสปญ'
            ],
            [
              'name' =>'รัสเซีย'
            ],
            [
              'name' =>'โปแลนด์'
            ],
            [
              'name' =>'เชคโกสโลวาเกีย'
            ],
            [
              'name' =>'ฮังการี'
            ],
            [
              'name' =>'กรีก'
            ],
            [
              'name' =>'ยูโกสลาเวีย'
            ],
            [
              'name' =>'ลักเซมเบอร์ก'
            ],
            [
              'name' =>'วาติกัน'
            ],
            [
              'name' =>'มอลต้า'
            ],
            [
              'name' =>'อัลบาเนีย'
            ],
            [
              'name' =>'บัลกาเรีย'
            ],
            [
              'name' =>'รูเมเนีย'
            ],
            [
              'name' =>'ไซปรัส'
            ],
            [
              'name' =>'อเมริกา'
            ],
            [
              'name' =>'คานาดา'
            ],
            [
              'name' =>'เม็กซิโก'
            ],
            [
              'name' =>'คิวบา'
            ],
            [
              'name' =>'อาร์เจนตินา'
            ],
            [
              'name' =>'บราซิล'
            ],
            [
              'name' =>'ชิลี'
            ],
            [
              'name' =>'อีคัวดอร์'
            ],
            [
              'name' =>'โคลัมเบีย'
            ],
            [
              'name' =>'บาร์บาดอส'
            ],
            [
              'name' =>'เปรู'
            ],
            [
              'name' =>'ปานามา'
            ],
            [
              'name' =>'อุรุกวัย'
            ],
            [
              'name' =>'เวเนสุเอล่า'
            ],
            [
              'name' =>'เปอร์โตริโก้'
            ],
            [
              'name' =>'จีน'
            ],
            [
              'name' =>'อินเดีย'
            ],
            [
              'name' =>'เวียดนาม'
            ],
            [
              'name' =>'ญี่ปุ่น'
            ],
            [
              'name' =>'พม่า'
            ],
            [
              'name' =>'ฟิลิปปินส์'
            ],
            [
              'name' =>'มาเลเซีย'
            ],
            [
              'name' =>'อินโดนีเซีย'
            ],
            [
              'name' =>'ปากีสถาน'
            ],
            [
              'name' =>'เกาหลี'
            ],
            [
              'name' =>'สิงคโปร์'
            ],
            [
              'name' =>'เนปาล'
            ],
            [
              'name' =>'ลาว'
            ],
            [
              'name' =>'กัมพูชา'
            ],
            [
              'name' =>'ศรีลังกา'
            ],
            [
              'name' =>'ซาอุดิอารเบีย'
            ],
            [
              'name' =>'อิสราเอล'
            ],
            [
              'name' =>'เลบานอน'
            ],
            [
              'name' =>'อิหร่าน (เปอร์เซีย)'
            ],
            [
              'name' =>'เตอร์กี'
            ],
            [
              'name' =>'บังคลาเทศ'
            ],
            [
              'name' =>'อาหรับ'
            ],
            [
              'name' =>'ซีเรีย'
            ],
            [
              'name' =>'อิรัค'
            ],
            [
              'name' =>'คูเวต'
            ],
            [
              'name' =>'บรูไน'
            ],
            [
              'name' =>'อาฟริกาใต้'
            ],
            [
              'name' =>'ยูดาน'
            ],
            [
              'name' =>'ตูนีเซีย'
            ],
            [
              'name' =>'เคนยา'
            ],
            [
              'name' =>'อียิปต์'
            ],
            [
              'name' =>'เอธิโอเปีย'
            ],
            [
              'name' =>'ออสเตรเลีย'
            ],
            [
              'name' =>'นิวซีแลนด์'
            ],
            [
              'name' =>'ชาวเขาที่ไม่ได้สัญชาติไทย'
            ],
            [
              'name' =>'ญวนอพยพ'
            ],
            [
              'name' =>'จีนฮ่อ'
            ],
            [
              'name' =>'อดีตทหารจีนคณะชาติ'
            ],
            [
              'name' =>'พม่าพลัดถิ่น'
            ],
            [
              'name' =>'เขมรเกาะกงกัมพูชา'
            ],
            [
              'name' =>'ผู้อพยพอินโดจีนสัญชาติลาว'
            ],
            [
              'name' =>'ผู้อพยพอินโดจีนสัญชาติกัมพูชา'
            ],
            [
              'name' =>'ผู้อพยพอินโดจีนสัญชาติเวียดนาม'
            ],
            [
              'name' =>'ไทย-อิสลาม, อิสลาม-ไทย'
            ],
            [
              'name' =>'ไทย-จีน, จีน-ไทย'
            ],
            [
              'name' =>'ไร้สัญชาติ'
            ],
            [
              'name' =>'ไม่ได้สัญชาติไทยตาม ปว.337'
            ],
            [
              'name' =>'อื่น ๆ'
            ],
            [
              'name' =>'ไม่ระบุ'
            ]
        ]);
    }
}
